app/controllers/api/v1/training_records_controller.rb

SELECT "training_records".* FROM "training_records" WHERE "training_records"."training_menu_id" = ? AND "training_records"."user_id" = ? ORDER BY "training_records"."recorded_at" DESC  [["training_menu_id", 1], ["user_id", 1]]
---
      def index
        records = @training_menu.training_records.where(user: @user).order(recorded_at: :desc)

INSERT INTO "training_records" ("user_id", "training_menu_id", "count", "recorded_at", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["user_id", 1], ["training_menu_id", 1], ["count", 30], ["recorded_at", "2024-06-01 10:00:00"], ["created_at", "2025-06-22 05:22:50.040433"], ["updated_at", "2025-06-22 05:22:50.040433"]]
---
      def create
        record = @training_menu.training_records.new(record_params.merge(user: @user))
        if record.save

SELECT "training_menus".* FROM "training_menus" WHERE "training_menus"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      def set_training_menu
        @training_menu = TrainingMenu.find(params[:training_menu_id])

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
      def set_user
        @user = User.first