app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest", "email") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["name", "test"], ["created_at", "2025-06-23 13:17:08.295814"], ["updated_at", "2025-06-23 13:17:08.295814"], ["password_digest", "[FILTERED]"], ["email", "[FILTERED]"]]
---
      def create
        user = User.new(user_params)
        if user.save