app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def authenticate_user
    auth_header = request.headers['Authorization']
    return head :unauthorized unless auth_header.present?

    token = auth_header.split(' ').last
    begin
      payload, = JWT.decode(token, Rails.application.secret_key_base, true, algorithm: 'HS256')
      @current_user = User.find(payload['sub'])